package Interfaces;

public class Ex1_ChildClass extends Ex1_ParentClass {

    /*
     * Реализовать метод из интерфейса можно в дочернем классе
     */
    public void method2() {
        System.out.println("Это реализация method2 из интерфейса  ");
    }

}
